The  TopRailType  type exposes the following members.
 Properties
Name  |   Description
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from  Element  .)
BoundingBox
 Retrieves a box that circumscribes all geometry of the element.
 (Inherited from  Element  .)
CanBeCopied
 Determine if this ElementType can create a copy
 (Inherited from  ElementType  .)
CanBeDeleted
 Determine if this ElementType can be deleted
 (Inherited from  ElementType  .)
CanBeRenamed
 Determine if this ElementType can be renamed
 (Inherited from  ElementType  .)
Category
 Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from  Element  .)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from  Element  .)
DefaultJoinOption
 The default join option between two rails.
 (Inherited from  ContinuousRailType  .)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from  Element  .)
DesignOption
 Returns the design option to which the element belongs.
 (Inherited from  Element  .)
Document
 Returns the Document in which the Element resides.
 (Inherited from  Element  .)
EndOrTopExtensionLength
 The extension length of the rail termination at the end or top.
 (Inherited from  ContinuousRailType  .)
EndOrTopExtensionStyle
 The extension style of the rail termination at the end or top.
 (Inherited from  ContinuousRailType  .)
EndOrTopTermination
 The termination of the rail at the end or top.
 (Inherited from  ContinuousRailType  .)
FamilyName
 Gets the family name of this element type.
 (Inherited from  ElementType  .)
FilletRadius
 The fillet radius of the rail join.
 (Inherited from  ContinuousRailType  .)
Geometry
 Retrieves the geometric representation of the element.
 (Inherited from  Element  .)
GroupId
 The id of the group to which an element belongs.
 (Inherited from  Element  .)
HandClearance
 The horizontal distance between the inner boundary of the rail and the path.
 (Inherited from  ContinuousRailType  .)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from  Element  .)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  Element  .)
LevelId
 The id of the level associated with the element.
 (Inherited from  Element  .)
Location
 This property is used to find the physical location of an element within a project.
 (Inherited from  Element  .)
Name
 Set the name for the ElementType.
 (Inherited from  ElementType  .)
OwnerViewId
 The id of the view that owns the element.
 (Inherited from  Element  .)
Parameter Guid
 Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from  Element  .)
Parameter String
 Retrieves a parameter from the element given its name.
 (Inherited from  Element  .)
Parameter BuiltInParameter
 Retrieves a parameter from the element given a parameter id.
 (Inherited from  Element  .)
Parameter Definition
 Retrieves a parameter from the element based on its definition.
 (Inherited from  Element  .)
Parameters
 Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from  Element  .)
ParametersMap
 Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from  Element  .)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from  Element  .)
ProfileId
 The id of the profile of the rail
 (Inherited from  ContinuousRailType  .)
Projection
 The horizontal distance between the outer boundary of the rail and the path.
 (Inherited from  ContinuousRailType  .)
StartOrBottomExtensionLength
 The extension length of the rail termination at the beginning or bottom.
 (Inherited from  ContinuousRailType  .)
StartOrBottomExtensionStyle
 The extension style of the rail termination at the beginning or bottom.
 (Inherited from  ContinuousRailType  .)
StartOrBottomTermination
 The termination of the rail at the beginning or bottom.
 (Inherited from  ContinuousRailType  .)
Transition
 The transition option of the rail.
 (Inherited from  ContinuousRailType  .)
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from  Element  .)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from  Element  .)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from  Element  .)
 See Also
  TopRailType Class
  Autodesk.Revit.DB.Architecture Namespace